setwd("D:/3 курс 2 семестр/Хранилище бизнес информации")
mydate<-read.table(file="Syria.txt",header =TRUE)
dim1<- c(mydate [1:16, 1],"сумма")
dim2<-c("терроризм","террорист","оккупация","наркотики","насилие","демократия","развитие")
dim3<-c("Молдавия","Афганистан","Киргизия","Пакистан","Украина","Россия","Грузия","Узбекистан","Сирия","Таджикистан","Ливия","Тунис","Египет","Израиль","Йемен","Ирак","Палестина","Иран","Ливан","Турция")
alltable<- array(0,c(17,7,20),list(dim1,dim2,dim3))
alltable
vars<- c(c("Молдавия" ,"Afganistan.txt" ,"Киргизия" ,"Пакистан" ,"Украина" ,"Россия"  ,"Georgia.txt"  ,"Узбекистан"  ,"Syria.txt" ,"Таджикистан","Ливия" ,"tunisia.txt","Египет","Израиль","Yemen.txt","Ирак.txt","Палестина","Иран","Ливан","Turkey.txt"))
for (s in c(2,7,12,15,16,20)){
  mydate<-read.table(vars[s],header =TRUE )
for( y in 1:16){
  for(v in 1:7) {
    alltable[y,v,s]<-mydate[y,v,+1]
  }
}
for (v in 1:7){
  alltable [y+1,v,s]<-sum (mydate[,v+1])
}
}

